"""
Домашнє завдання #1
Климентій Сподін
Version Python 3.11.6
"""

"""
TASK #1
Запросіть у користувача ім'я та місячну зарплату в доларах та виведіть їхню річну зарплату в тисячах доларів.
Наприклад: «Мішель», «12345» → «Річна зарплата Мішель складає 148 тис. доларів».
"""
MONTH_IN_YEAR = 12

user_name = input("Введіть ім'я користувача: ").strip()
monthly_salary_usd = int(input('Введіть місячну зарплату в доларах США: '))

yearly_salary_usd = MONTH_IN_YEAR * monthly_salary_usd

print(f'Річна зарплата {user_name} складає {round(yearly_salary_usd / 1000)} тис. доларів США.')


"""
TASK #2
Запросіть ціле число і виведіть True, якщо це парне число діапазоні від 100 до 999, інакше - «False»
"""
num = int(input('Введіть ціле число: ').strip())

print(True) if (num % 2 == 0) and (100 <= num < 999) else print(False)


"""
TASK #3
Як вхідні дані візьмемо ціле число; Це число від 101 до 999, а його остання цифра не дорівнює нулю.
Виведіть число, що складається з чисел першого у зворотньому порядку. Наприклад: 256 → 652.
"""
num = int(input('Введіть ціле число від 101 до 999 та яке не закінчується на 0: ').strip())

if (101 < num < 999) and (num % 10 != 0):
    palindrome_num = int(str(num)[::-1])
    print(palindrome_num)
else:
    print('Помилка! Не виконані умови до числа!')


"""
TASK #4
Запитайте два цілих числа та виведіть:
a. Їхню суму
b. Їхня різниця
c. результат множення
d. Результат поділу першого на друге
e. Залишок від поділу першого на друге
f. True, якщо перше число більше або дорівнює другому, інакше False.
"""
num_1 = int(input('Введіть перше ціле число: ').strip())
num_2 = int(input('Введіть друге ціле число: ').strip())

print(f'Сумма чисел: {num_1 + num_2}')
print(f'Різниця чисел: {num_1 - num_2}')
print(f'Результат множення: {num_1 * num_2}')
print(f'Результат поділу першого на друге: {round(num_1 / num_2, 3)}')
print(f'Залишок від поділу першого на друге: {num_1 % num_2}')

print(True) if num_1 >= num_2 else print(False)
