"""Створення масиву та операції"""
# Створіть два одновимірних масиви розміром 5×5 кожен, заповніть їх випадковими числами.
# Потім виконайте наступні операції та виведіть результат:

# Сума елементів кожного масиву.

# Різниця між елементами двох масивів.
# Перемноження елементів двох масивів.

# Підняття кожного елемента першого масиву до ступеня відповідного елемента другого масиву.


"""Індексація та вибірка даних"""
# Створіть двовимірний масив 8×8, який відображає шахову дошку (1 – біла клітина, 0 – чорна клітина).
# Використовуйте індексацію для виведення на екран:

# Рядок, представляючи 3-й рядок з дошки.
# Стовпець, представляючи 5-й стовпець з дошки.
# Підмасив, представляючи частину дошки розміром 3×3 в лівому верхньому куті.


"""Статистика та робота зі зображеннями"""
# Завантажте зображення (наприклад, за допомогою бібліотеки Pillow).
# Перетворіть його в тривимірний NumPy-масив та виведіть інформацію про розмір та тип даних.
# Проведіть статистичний аналіз:

# Знайдіть середнє значення, мінімум та максимум для кожного каналу зображення (R, G, B).
# Підрахуйте загальну суму інтенсивності пікселів та виведіть її.
# Виконайте нормалізацію зображення, розділивши значення кожного пікселя на максимальне значення.
