"""
Задача 1: Знайти середній вік студентів
Задача 2: Перевірити, чи є хоча б один студент, чий вік менше 20 років
Задача 3: Перевірити, чи всі студенти отримали оцінку не нижче 70
Задача 4: Знайти ім'я студента з максимальною оцінкою
"""

students = [
    {"ім'я": 'Анна', 'вік': 22, 'оцінка': 75},
    {"ім'я": 'Петро', 'вік': 19, 'оцінка': 85},
    {"ім'я": 'Олена', 'вік': 21, 'оцінка': 92},
    {"ім'я": 'Іван', 'вік': 23, 'оцінка': 68},
    {"ім'я": 'Марія', 'вік': 22, 'оцінка': 78}
]


average_age = sum(student['вік'] for student in students) / len(students)
is_under_20 = any(student['вік'] < 20 for student in students)
all_above_70 = all(student['оцінка'] >= 70 for student in students)
student_with_highest_grade = max(students, key=lambda x: x['оцінка'])


print('Середній вік студентів:', average_age)
print('Чи є хоча б один студент віком до 20 років:', is_under_20)
print('Чи всі студенти отримали оцінку не нижче 70:', all_above_70)
print("Ім'я студента з найвищою оцінкою:", student_with_highest_grade["ім'я"])
